# Pandas
* Two types of data types
  1. Single Dimentional called series
  2. Multi Dimentional called Data Frame

In [1]:
import pandas as pd
import numpy as np

### Series

In [2]:
# Single Dimentinal
ser=pd.Series([1,2,3,4,5])
ser

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
type(ser)

pandas.core.series.Series

In [5]:
# to change the indexes
ser=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
# using the dictionary
ser=pd.Series({'a':10,'b':20,'c':30,'d':40})
ser

a    10
b    20
c    30
d    40
dtype: int64

In [7]:
ser+5

a    15
b    25
c    35
d    45
dtype: int64

In [10]:
# Adding the two series
ser1=pd.Series([100,-60,-76,87])
ser2=pd.Series([10,20,30,40])
ser1+ser2

0    110
1    -40
2    -46
3    127
dtype: int64

### Data Frame

In [11]:
# Multi Dimentional
df=pd.DataFrame({'Name':['Awais','Hamza','Abdullah','Raja'],'Marks':[3.55,3.77,3.20,3.76]})
df

       Name  Marks
0     Awais   3.55
1     Hamza   3.77
2  Abdullah   3.20
3      Raja   3.76

***some DataFrame functions*** 
head(),tail(),describe(),shape()

In [13]:
df.shape

(4, 2)

In [14]:
# identify the numerical values automatcally and then perform all actions
df.describe()

          Marks
count  4.000000
mean   3.570000
std    0.266708
min    3.200000
25%    3.462500
50%    3.655000
75%    3.762500
max    3.770000

In [21]:
# Reading files
df=pd.read_csv('IRIS.csv')
df

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [18]:
df.head(10)

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa
5           5.4          3.9           1.7          0.4  Iris-setosa
6           4.6          3.4           1.4          0.3  Iris-setosa
7           5.0          3.4           1.5          0.2  Iris-setosa
8           4.4          2.9           1.4          0.2  Iris-setosa
9           4.9          3.1           1.5          0.1  Iris-setosa

In [19]:
df.shape

(150, 5)

In [22]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [2]:
# how to make a DataFrame
df=pd.DataFrame(np.arange(1,31).reshape(5,6),index=['Row1','Row2','Row3','Row4','Row5'],
               columns=['col1','col2','col3','col4','col5','col6'])

In [3]:
df

      col1  col2  col3  col4  col5  col6
Row1     1     2     3     4     5     6
Row2     7     8     9    10    11    12
Row3    13    14    15    16    17    18
Row4    19    20    21    22    23    24
Row5    25    26    27    28    29    30

In [4]:
# to save your data into file
df.to_csv('MyData.csv')

In [5]:
# Accesing the elements
# 1 .loc (for rows only)   2 .iloc (for both rows and column index)

In [6]:
# use [] brackets
df.loc['Row4']

col1    19
col2    20
col3    21
col4    22
col5    23
col6    24
Name: Row4, dtype: int32

In [7]:
type(df.loc['Row4'])

pandas.core.series.Series

In [8]:
# first for rows second for columns
df.iloc[:2,3:]

      col4  col5  col6
Row1     4     5     6
Row2    10    11    12

In [9]:
df.iloc[3:,:2]

      col1  col2
Row4    19    20
Row5    25    26

In [10]:
type(df.iloc[3:,:2])

pandas.core.frame.DataFrame

In [11]:
# Convert dataframe into numpy arrays
array = df.iloc[:,:].values

In [12]:
array

array([[ 1,  2,  3,  4,  5,  6],
       [ 7,  8,  9, 10, 11, 12],
       [13, 14, 15, 16, 17, 18],
       [19, 20, 21, 22, 23, 24],
       [25, 26, 27, 28, 29, 30]])

In [13]:
type(array)

numpy.ndarray

In [14]:
df

      col1  col2  col3  col4  col5  col6
Row1     1     2     3     4     5     6
Row2     7     8     9    10    11    12
Row3    13    14    15    16    17    18
Row4    19    20    21    22    23    24
Row5    25    26    27    28    29    30

In [15]:
# To check unique catagories
df['col1'].value_counts()

col1
1     1
7     1
13    1
19    1
25    1
Name: count, dtype: int64

In [16]:
df['col1'].unique()

array([ 1,  7, 13, 19, 25])

In [17]:
# to check null
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
col5    0
col6    0
dtype: int64

In [18]:
import io

In [19]:
from io import StringIO, BytesIO

In [20]:
data = ('col1,col2,col3\n'
       'x,y,1\n'
       'a,b,2\n'
       'c,d,3\n')

In [21]:
type(data)

str

In [22]:
df = pd.read_csv(StringIO(data))

In [23]:
df

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [46]:
data1 = ('a,b,c,d\n'
       '1,2,3,4\n'
       '5,6,7,8\n'
       '9,10,11,12')

In [32]:
df1 = pd.read_csv(StringIO(data1),dtype=object)

In [33]:
df1

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [35]:
# for changing every columns different data types 
df2 = pd.read_csv(StringIO(data1),dtype={'a':int,'b':float,'c':object,'d':str})

In [41]:
df2.dtypes

a      int32
b    float64
c     object
d     object
dtype: object

In [43]:
df1

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [47]:
# if i want to remove the index then 
pd.read_csv(StringIO(data1),index_col=0)

    b   c   d
a
1   2   3   4
5   6   7   8
9  10  11  12

### Reading the jeson file

In [7]:
Data = '{"Name":"Awais","Age":24,"Job_pro":[{"Role":"Manager","Salary":1000,"Exp":"4 years"}]}'

In [8]:
dfj = pd.read_json(Data)

C:\Users\MR OSMAN\AppData\Local\Temp\ipykernel_9248\1724151590.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  dfj = pd.read_json(Data)

In [9]:
dfj

    Name  Age                                            Job_pro
0  Awais   24  {'Role': 'Manager', 'Salary': 1000, 'Exp': '4 ...

### Pickling
*Pickling in pandas is a way to save a DataFrame (or other pandas objects) to a file so that you can load it back later.
It’s useful when you have a DataFrame that takes a lot of time to create or load. Instead of recreating it every time you run your code, you can pickle it once and load it quickly later.*

In [10]:
# so its only the saving method
dfj.to_pickle('data.pkl')